ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_cpu_sys_regs.xml
	<register id="PCLKCR3" width="32" page="1" offset="0x28" internal="0" description="Peripheral Clock Gating Register - ECAP">
		<bitfield id="ECAP1" description="ECAP1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2" description="ECAP2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR4" width="32" page="1" offset="0x2a" internal="0" description="Peripheral Clock Gating Register - EQEP">
		<bitfield id="EQEP1" description="EQEP1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EQEP3" description="EQEP3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR7" width="32" page="1" offset="0x30" internal="0" description="Peripheral Clock Gating Register - SCI">
		<bitfield id="SCI_A" description="SCI_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SCI_B" description="SCI_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SCI_C" description="SCI_C Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR8" width="32" page="1" offset="0x32" internal="0" description="Peripheral Clock Gating Register - SPI">
		<bitfield id="SPI_A" description="SPI_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SPI_B" description="SPI_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR9" width="32" page="1" offset="0x34" internal="0" description="Peripheral Clock Gating Register - I2C">
		<bitfield id="I2C_A" description="I2C_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="I2C_B" description="I2C_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR10" width="32" page="1" offset="0x36" internal="0" description="Peripheral Clock Gating Register - CAN">
		<bitfield id="MCAN_A" description="MCAN_A Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR11" width="32" page="1" offset="0x38" internal="0" description="Peripheral Clock Gating Register - McBSP_USB">
		<bitfield id="USB_A" description="USB_A Clock Enable bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR12" width="32" page="1" offset="0x3a" internal="0" description="Peripheral Clock Gating Register - Upp">
		<bitfield id="TINIE" description="TINIE Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR13" width="32" page="1" offset="0x3c" internal="0" description="Peripheral Clock Gating Register - ADC">
		<bitfield id="ADC_A" description="ADC_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADC_D" description="ADC_D Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADC_E" description="ADC_E Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR14" width="32" page="1" offset="0x3e" internal="0" description="Peripheral Clock Gating Register - CMPSS">
		<bitfield id="CMPSS1" description="CMPSS1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR15" width="32" page="1" offset="0x40" internal="0" description="Peripheral Clock Gating Register - PGA">
		<bitfield id="PGA1" description="PGA1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PGA2" description="PGA2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PGA3" description="PGA3 Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR16" width="32" page="1" offset="0x42" internal="0" description="Peripheral Clock Gating Register Buf_DAC">
		<bitfield id="DAC_A" description="Buffered_DAC_A Clock Enable Bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR17" width="32" page="1" offset="0x44" internal="0" description="Peripheral Clock Gating Register - CLB">
		<bitfield id="CLB1" description="CLB1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR18" width="32" page="1" offset="0x46" internal="0" description="Peripheral Clock Gating Register - FSI">
		<bitfield id="FSITX_A" description="FSITX_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_A" description="FSIRX_A Clock Enable bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR19" width="32" page="1" offset="0x48" internal="0" description="Peripheral Clock Gating Register - LIN">
		<bitfield id="LIN_A" description="LIN_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR20" width="32" page="1" offset="0x4a" internal="0" description="Peripheral Clock Gating Register - PMBUS">
		<bitfield id="PMBUS_A" description="PMBUS_A Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR21" width="32" page="1" offset="0x4c" internal="0" description="Peripheral Clock Gating Register - DCC">
		<bitfield id="DCC0" description="DCC0 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC1 Clock Enable Bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR26" width="32" page="1" offset="0x56" internal="0" description="Peripheral Clock Gating Register - AES">
		<bitfield id="AESA" description="AESA Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR27" width="32" page="1" offset="0x58" internal="0" description="Peripheral Clock Gating Register - EPG">
		<bitfield id="EPG1" description="EPG1 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
