ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p55x_cpu_sys_regs.xml
	<register id="MCANRAMACC" width="32" page="1" offset="0x90" internal="0" description="MCAN RAM access control Register">
		<bitfield id="MCAN_A_RAMACC" description="MCAN_A_RAMACC Message RAM access control Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B_RAMACC" description="MCAN_B_RAMACC Message RAM access control Bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="MCANWAKESTATUS" width="32" page="1" offset="0x98" internal="0" description="MCAN Wake Status Register">
		<bitfield id="WAKE_MCANA" description="MCANA Wake Status " begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="WAKE_MCANB" description="MCANB Wake Status " begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="MCANWAKESTATUSCLR" width="32" page="1" offset="0x9a" internal="0" description="MCAN Wake Status Clear Register">
		<bitfield id="WAKE_MCANA" description="Cear bit for MCANWAKESTATUS.WAKE_MCANA bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="WAKE_MCANB" description="Cear bit for MCANWAKESTATUS.WAKE_MCANB bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CLKSTOPREQ" width="32" page="1" offset="0x9c" internal="0" description="Peripheral Clock Stop Request Register">
		<bitfield id="MCAN_A" description="MCAN_A Clock Stop Request Bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B Clock Stop Request Bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key for register write " begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CLKSTOPACK" width="32" page="1" offset="0x9e" internal="0" description="Peripheral Clock Stop Ackonwledge Register">
		<bitfield id="MCAN_A" description="MCAN_A Clock Stop Ack Bit" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="MCAN_B" description="MCAN_B Clock Stop Ack Bit" begin="9" end="9" width="1" rwaccess="R"/>
	</register>
	<register id="USER_REG1_SYSRSn" width="32" page="1" offset="0xa0" internal="0" description="Software Configurable registers reset by SYSRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_SYSRSn" width="32" page="1" offset="0xa2" internal="0" description="Software Configurable registers reset by SYSRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG1_XRSn" width="32" page="1" offset="0xa4" internal="0" description="Software Configurable registers reset by XRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_XRSn" width="32" page="1" offset="0xa6" internal="0" description="Software Configurable registers reset by XRSn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG1_PORESETn" width="32" page="1" offset="0xa8" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG2_PORESETn" width="32" page="1" offset="0xaa" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG3_PORESETn" width="32" page="1" offset="0xac" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="USER_REG4_PORESETn" width="32" page="1" offset="0xae" internal="0" description="Software Configurable registers reset by PORESETn">
		<bitfield id="BITS" description="SW configurable bits" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="JTAG_MMR_REG" width="32" page="1" offset="0xb0" internal="0" description="Readback of JTAG registers for test purpose">
	</register>
</module>
